### Pandas slicing and indexing

In [1]:
import pandas as pd

In [4]:
df=pd.DataFrame({'A':[1,2,3],"B":[True,True,False],"C":[0.496714,-0.138264,0.647689]},index=["a","b","c"])
df

   A      B         C
a  1   True  0.496714
b  2   True -0.138264
c  3  False  0.647689

In [5]:
df["A"]

a    1
b    2
c    3
Name: A, dtype: int64

In [7]:
df[["A","B"]]

   A      B
a  1   True
b  2   True
c  3  False

In [10]:
df.loc["a"]

A           1
B        True
C    0.496714
Name: a, dtype: object

In [11]:
df.loc[["a","b"]]

   A     B         C
a  1  True  0.496714
b  2  True -0.138264

In [13]:
df.iloc[:2]

   A     B         C
a  1  True  0.496714
b  2  True -0.138264

In [14]:
df.iloc[[0,1]]

   A     B         C
a  1  True  0.496714
b  2  True -0.138264

In [15]:
df.loc["a":"b",["A","C"]]

   A         C
a  1  0.496714
b  2 -0.138264

In [16]:
df

   A      B         C
a  1   True  0.496714
b  2   True -0.138264
c  3  False  0.647689

In [17]:
df.loc[:,"A"]

a    1
b    2
c    3
Name: A, dtype: int64

In [18]:
df.A

a    1
b    2
c    3
Name: A, dtype: int64

In [19]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [20]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

### Dataset

In [21]:
data=pd.read_csv("stockprice_data.csv")

In [22]:
data

         Date  Closing price    Return
0    1/1/2020            100  0.010000
1    2/1/2020            120  0.200000
2    3/1/2020            130  0.083333
3    4/1/2020             98 -0.246154
4    5/1/2020             50 -0.489796
5    6/1/2020            102  1.040000
6    7/1/2020            104  0.019608
7    8/1/2020            150  0.442308
8    9/1/2020            160  0.066667
9   10/1/2020            109 -0.318750
10  11/1/2020             95 -0.128440

In [23]:
type(data)

pandas.core.frame.DataFrame

In [ ]:
data.loc[:,"Retu"]

In [27]:
data.iloc[:,2]

0     0.010000
1     0.200000
2     0.083333
3    -0.246154
4    -0.489796
5     1.040000
6     0.019608
7     0.442308
8     0.066667
9    -0.318750
10   -0.128440
Name: Return, dtype: float64

In [25]:
data1=data.Return
data1

0     0.010000
1     0.200000
2     0.083333
3    -0.246154
4    -0.489796
5     1.040000
6     0.019608
7     0.442308
8     0.066667
9    -0.318750
10   -0.128440
Name: Return, dtype: float64

In [26]:
type(data1)

pandas.core.series.Series

In [29]:
### Display all the rows using pandas
### Display all the columns  using pandas
pd.set_option("display.max_rows",None)
pd.set_option("display.max_columns",None)

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings("ignore")
pd.set_option("display.max_rows",None)
pd.set_option("display.max_columns",None)

In [ ]:
### Drop one column

In [30]:
df=pd.read_csv("automobile_data.csv")

In [31]:
df.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

In [32]:
df=df.drop("index",axis=1)
df.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0